In [1]:
import pandas as pd
import numpy as np

In [3]:
df1 = pd.DataFrame({'emp':['Bob','Jake','Lisa','Sue'],
                    'group':['Accounting','Engineering','Engineering','HR']})
df2 = pd.DataFrame({'emp':['Lisa','Bob','Jake','Sue'],
                     'Hire_Date':[2004,2008,2012,2014]})

In [4]:
df1

    emp        group
0   Bob   Accounting
1  Jake  Engineering
2  Lisa  Engineering
3   Sue           HR

In [5]:
df2

   Hire_Date   emp
0       2004  Lisa
1       2008   Bob
2       2012  Jake
3       2014   Sue

In [7]:
df3 = df1.merge(df2)

In [8]:
df3

    emp        group  Hire_Date
0   Bob   Accounting       2008
1  Jake  Engineering       2012
2  Lisa  Engineering       2004
3   Sue           HR       2014

In [24]:
def fib(n):
     a, b = 0, 1
     c = []
     while a < n:
         c.append(a)
         a, b = b, a+b
     print c
     return c
a=fib(500)

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377]

In [25]:
a

[0, 1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, 144, 233, 377]

In [28]:
import matplotlib.pyplot as py

In [32]:
df4 = pd.DataFrame({'group':['Accounting', 'Engineering', 'HR'],
                   'Supervisor':['Carly','Guido','Steve']})

In [33]:
df4

  Supervisor        group
0      Carly   Accounting
1      Guido  Engineering
2      Steve           HR

In [35]:
df3.merge(df4)

    emp        group  Hire_Date Supervisor
0   Bob   Accounting       2008      Carly
1  Jake  Engineering       2012      Guido
2  Lisa  Engineering       2004      Guido
3   Sue           HR       2014      Steve

In [36]:
df5 = pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],
                   'skills':['math','spreadsheets','coding','linux','spreadsheets','organisation']})

In [37]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organisation

In [38]:
df1.merge(df5)

    emp        group        skills
0   Bob   Accounting          math
1   Bob   Accounting  spreadsheets
2  Jake  Engineering        coding
3  Jake  Engineering         linux
4  Lisa  Engineering        coding
5  Lisa  Engineering         linux
6   Sue           HR  spreadsheets
7   Sue           HR  organisation

In [39]:
df1.merge(df2, on='emp')

    emp        group  Hire_Date
0   Bob   Accounting       2008
1  Jake  Engineering       2012
2  Lisa  Engineering       2004
3   Sue           HR       2014

In [40]:
df3 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],
                   'salary':[70000,80000,120000,90000]})

In [42]:
df1.merge(df3,left_on='emp',right_on='name')

    emp        group  name  salary
0   Bob   Accounting   Bob   70000
1  Jake  Engineering  Jake   80000
2  Lisa  Engineering  Lisa  120000
3   Sue           HR   Sue   90000

In [43]:
df1.merge(df3,left_on='emp',right_on='name').drop('name',axis=1)

    emp        group  salary
0   Bob   Accounting   70000
1  Jake  Engineering   80000
2  Lisa  Engineering  120000
3   Sue           HR   90000

In [44]:
df1a = df1.set_index('emp')

In [45]:
df1a

            group
emp
Bob    Accounting
Jake  Engineering
Lisa  Engineering
Sue            HR

In [47]:
type(df1)

pandas.core.frame.DataFrame

In [48]:
df2a = df2.set_index('emp')

In [50]:
df2a

      Hire_Date
emp
Lisa       2004
Bob        2008
Jake       2012
Sue        2014

In [51]:
df1a.join(df2a)

            group  Hire_Date
emp
Bob    Accounting       2008
Jake  Engineering       2012
Lisa  Engineering       2004
Sue            HR       2014

In [52]:
df6 = pd.DataFrame({'name':['Peter','Paul','Mary'],
                    'food':['fish','beans','bread']}, columns = ['name','food'])

In [53]:
df7 = pd.DataFrame({'name':['Mary','Joseph'],
                    'drink':['wine','beer']}, columns = ['name','drink'])

In [55]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [56]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [57]:
df6.merge(df7)

   name   food drink
0  Mary  bread  wine

In [58]:
import seaborn as sns
import pandas as pd

In [60]:
import pandas as pd
import numpy as np

In [61]:
rng = np.random.RandomState(42)

In [62]:
ser = pd.Series(rng.rand(5))

In [63]:
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [65]:
from datetime import datetime
datetime(year = 2015, month = 7, day = 4)

datetime.datetime(2015, 7, 4, 0, 0)

In [66]:
from dateutil import parser

In [67]:
date = np.array('2015-07-04', dtype = np.datetime64)